redditclone/app/controllers/subs_controller.rb

INSERT INTO "subs" ("title", "description", "moderator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "something"], ["description", "bla bla"], ["moderator_id", 1], ["created_at", "2021-02-15 17:08:58.899932"], ["updated_at", "2021-02-15 17:08:58.899932"]]
---
    def create
        @sub = Sub.create(sub_params)
        if @sub.save

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "subs" SET "description" = $1, "updated_at" = $2 WHERE "subs"."id" = $3  [["description", "bla bla BLAH"], ["updated_at", "2021-02-15 19:26:48.664715"], ["id", 7]]
---
    def update
        @sub = Sub.find(params[:id])
        if @sub && @sub.update(sub_params)