redditclone/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "Q7WvTpKy3OV3dMtT7HavARmI0rHP5ogvHgJHVYNqLdk"], ["updated_at", "2021-02-15 16:23:23.450913"], ["id", 2]]
---
    def create
        @user = User.create(user_params)
        if @user.save