redditclone/app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "Q7WvTpKy3OV3dMtT7HavARmI0rHP5ogvHgJHVYNqLdk"], ["updated_at", "2021-02-15 16:23:23.450913"], ["id", 2]]
---
    def reset_session_token!
        self.session_token = SecureRandom::urlsafe_base64(32)
        self.save

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "hank"], ["LIMIT", 1]]
---
    def self.find_by_credentials(username, password)
        @user = User.find_by(username: username)